app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def pdf
    @users = User.all

INSERT INTO "users" ("name", "mail", "date_of_birth", "actual_weight", "ideal_weight", "size", "in_diet", "like_diet", "cv", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    user_params_tmp = user_params
    if user_params["name"].present? && user_params["mail"].present? && user_params["date_of_birth"].present? && user_params["actual_weight"].present? && user_params["ideal_weight"].present? && user_params["size"].present? && (user_params["like_diet"]==false || user_params["like_diet"]==true)  && (user_params["like_diet"]==false || user_params["like_diet"]==true)
      user_params_tmp["name"]=user_params_tmp["name"].upcase
    end
    @user = User.new(user_params_tmp)
    if @user.save

UPDATE "users" SET "name" = ?, "mail" = ?, "actual_weight" = ?, "ideal_weight" = ?, "size" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "JAMET"], ["mail", "jason.jamet@gmail.com"], ["actual_weight", 64], ["ideal_weight", 63], ["size", 172], ["updated_at", "2015-02-09 10:46:26.050163"], ["id", 5]]
---
  def update
    user_params_tmp = user_params
    if user_params["name"].present? && user_params["mail"].present? && user_params["date_of_birth"].present? && user_params["actual_weight"].present? && user_params["ideal_weight"].present? && user_params["size"].present? && (user_params["like_diet"]==false || user_params["like_diet"]==true)  && (user_params["like_diet"]==false || user_params["like_diet"]==true)
      user_params_tmp["name"]=user_params_tmp["name"].upcase
    end
    if @user.update(user_params_tmp)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user.remove_cv!
    @user.delete

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_user
    if(!User.exists?(params[:id]))
      redirect_to "/404.html"
    else
      @user = User.find(params[:id])